{
  "backend/main.mo": "Main Motoko canister defining user profiles, catalog types, carts, orders, returns, analytics, and admin/user operations with storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping admin product‑management improvements to related frontend files and components.",
  "frontend-file-summaries.txt": "Text file providing one‑sentence summaries for various frontend components, hooks, pages, and static assets.",
  "frontend/index.css": "Tailwind CSS setup defining base variables and light/dark theme tokens for global styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading the main TypeScript bundle.",
  "frontend/public/llms.txt": "Static metadata file describing the storefront business, structure, features, and technical details for LLMs.",
  "frontend/src/App.tsx": "Sets up the React router, layout, routes, and providers for the storefront and admin areas.",
  "frontend/src/components/admin/InventoryEditor.tsx": "Dialog component allowing admins to update a product’s inventory with validation and API calls.",
  "frontend/src/components/admin/ProductEditor.tsx": "Form dialog for creating or editing products with validation, unsaved‑changes protection, and backend mutation hooks.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Protects admin-only routes by checking user role and showing loading or access denied states.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides login/logout button with Internet Identity handling and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Prompts newly authenticated users without profiles to enter their name and saves it.",
  "frontend/src/components/cart/CartLineItem.tsx": "Displays a cart item with image, price, quantity selector, subtotal, and remove button.",
  "frontend/src/components/catalog/FiltersPanel.tsx": "Renders category, brand, price, and availability filters based on product data.",
  "frontend/src/components/catalog/ProductCard.tsx": "Shows a product card with image, brand, name, price, and out-of-stock badge.",
  "frontend/src/components/catalog/SortMenu.tsx": "Dropdown to select product sort order such as relevance, price, or name.",
  "frontend/src/components/compliance/CookieConsentBanner.tsx": "Banner prompting users to accept or decline cookies with actions hooked to consent state.",
  "frontend/src/components/layout/Footer.tsx": "Displays site footer with navigation links, legal info, cookie preferences, and branding.",
  "frontend/src/components/layout/StoreLayout.tsx": "Main store layout with header, content outlet, footer, and cookie banner.",
  "frontend/src/components/nav/StickyHeader.tsx": "Sticky header with logo, search, navigation, account menu, admin link, and cart indicator.",
  "frontend/src/components/orders/InitiateReturnForm.tsx": "Form component that submits a return request with a text reason using a mutation hook.",
  "frontend/src/components/orders/StatusTimeline.tsx": "Displays an order's status history with labels and timestamps in a vertical timeline.",
  "frontend/src/components/product/ProductGallery.tsx": "Shows a product image with a zoomable modal viewer for larger display.",
  "frontend/src/components/recommendations/RecommendationsRow.tsx": "Fetches recommended products and renders up to four in a grid layout.",
  "frontend/src/components/search/HeaderSearch.tsx": "Implements a header search bar with debounced queries, dropdown results, and navigation on selection.",
  "frontend/src/components/seo/ProductJsonLd.tsx": "Outputs JSON‑LD metadata for a product to improve search engine visibility.",
  "frontend/src/hooks/admin/useAdminData.ts": "Provides admin-focused queries and mutations for analytics, orders, returns, and product management.",
  "frontend/src/hooks/auth/useProfile.ts": "Fetches and updates the authenticated user's profile using actor-based queries and mutations.",
  "frontend/src/hooks/auth/useUserRole.ts": "Retrieves the caller's user role or falls back to guest based on actor availability.",
  "frontend/src/hooks/cart/useCart.ts": "Manages cart queries and mutations for authenticated and guest users, including localStorage handling.",
  "frontend/src/hooks/catalog/useCatalog.ts": "Supplies product, variant, and full catalog queries via actor methods.",
  "frontend/src/hooks/catalog/useCatalogFilters.ts": "Builds catalog filters from URL params and returns filtered product lists with update helpers.",
  "frontend/src/hooks/compliance/useCookieConsent.ts": "Handles cookie consent state, persistence in localStorage, and banner visibility controls.",
  "frontend/src/hooks/orders/useOrder.ts": "Provides hooks to fetch a single order or full order history using the actor API with react-query.",
  "frontend/src/hooks/orders/usePlaceOrder.ts": "Defines a mutation to place an order via the actor and invalidates cart and order queries afterward.",
  "frontend/src/hooks/recommendations/useRecommendations.ts": "Fetches product recommendations and provides a mutation to track product views, refreshing recommendations on update.",
  "frontend/src/hooks/returns/useReturns.ts": "Provides hooks to fetch return requests and initiate new returns, invalidating related queries on success.",
  "frontend/src/hooks/search/useSearch.ts": "Runs product search via backend with a fuzzy-search fallback and caches results with react-query.",
  "frontend/src/hooks/seo/usePageMeta.ts": "Updates document title and meta description when page metadata changes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, handling login, stored identities, and identity lifecycle.",
  "frontend/src/index.css": "Global Tailwind CSS setup with theme variables, typography, focus styles, and custom scrollbars.",
  "frontend/src/main.tsx": "Bootstraps the app with react-query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/account/OrderDetailPage.tsx": "Displays a specific order’s details with status, items, shipping data, and supports viewing or initiating return requests.",
  "frontend/src/pages/account/OrdersPage.tsx": "Lists the user’s past orders with totals and statuses, providing links to detailed views.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing analytics such as order count, revenue, top products, and links to management sections.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays all orders for admins with details and allows updating order status.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Lists products with search, sorting, and editing tools, including dialogs for creating and updating products.",
  "frontend/src/pages/admin/AdminReturnsPage.tsx": "Shows return requests and lets admins approve, reject, or complete refunds.",
  "frontend/src/pages/CartPage.tsx": "Displays the shopping cart with item management, order summary, and checkout navigation.",
  "frontend/src/pages/CatalogPage.tsx": "Shows a product catalog with filters, sorting, hero banner, and product grid rendering.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout form that validates identity and cart contents, gathers contact and shipping info, and submits an order before navigating to the confirmation page.",
  "frontend/src/pages/legal/PrivacyPolicyPage.tsx": "Renders the site's privacy policy with sections on data collection, usage, security, and user rights.",
  "frontend/src/pages/legal/RefundPolicyPage.tsx": "Displays the refund policy including return conditions, process steps, and non‑returnable items.",
  "frontend/src/pages/legal/TermsPage.tsx": "Presents the terms of service describing user obligations, IP rights, and liability limits.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details including items, shipping info, status timeline, and navigation options after placing an order.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows product details, gallery, stock info, and allows adding items to the cart while tracking product views.",
  "frontend/src/utils/search/fuzzy.ts": "Implements edit‑distance and fuzzy matching functions for approximate text search.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read, persist, and clear URL and sessionStorage parameters, including support for hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and plugins for the frontend UI.",
  "project_state.json": "Defines the project’s metadata, architecture, features, and overall state configuration."
}